In [ ]:
============== EDA ============
1) Pandas : Data frame application

2) Numpy : Numerical python All math applications

3) Matplotlib : used for plotting

4) seaborn : used for plot

5) plotly : use for plot

6) Bokhe   : plot

=============== Machine learning ============
7) Sickit-learn : sklearn

=============== Deep learning ===============
8) Tensorflow : Google

9) keras      : Google 

10) pytorch   : FaceBook

=============== NLP ========================
11) NLTK   : Natural langague tool kit

12) Scipy

===============BERT ========================
13) Transformers : Hugging face (Google)

============ Google models ================
14) Specific google packages

============ Azure ML ===================
15) Azure packages

============ GenAI =====================
16) Gemini : Google

17) ChatGPT :OpenAI

============== LangChain ================
18) LangChain packages

**Create a dataframe using list**

In [ ]:
- list === dictionary
- dictionary === list

$Step-1$:

**Creat a dataframe**

In [2]:
import pandas as pd
names=['Ayush', 'Avinash','Akash']
pd.DataFrame()  #empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

$Step-2:$

**provide the data**

In [3]:
names=['Ayush', 'Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [5]:
names=['Ayush', 'Avinash','Akash']
age=[25,30,35]
pd.DataFrame(names,age)

          0
25    Ayush
30  Avinash
35    Akash

In [6]:
names=['Ayush', 'Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))
# what is the first positional argument : data
# second postinal argument : index

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [7]:
names=['Ayush', 'Avinash','Akash']
age=[25,30,35]
city=['hyd','brl','chennai']
pd.DataFrame(zip(names,age),city)

               0   1
hyd        Ayush  25
brl      Avinash  30
chennai    Akash  35

In [8]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','brl','chennai']
pd.DataFrame(zip(names,age,city))

         0   1        2
0    Ayush  25      hyd
1  Avinash  30      brl
2    Akash  35  chennai

In [9]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['hyd','brl','chennai']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
hyd        Ayush  25
brl      Avinash  30
chennai    Akash  35

$Step-3$:

**Provide the column names**

In [10]:
names=['Ayush', 'Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),
             columns=['Names','Age'])

     Names  Age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [12]:
names=['Ayush', 'Avinash','Akash']
age=[25,30,35]
city=['hyd','brl','chennai']

data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,columns=cols)

In [13]:
df

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      brl
2    Akash   35  chennai

In [14]:
type(df)

pandas.core.frame.DataFrame

$Step-4$

**ADD new column**

- If you want to add new column
- First you need to check the number of row in already existed data
- For example in above the dataframe has 3 rows
- You need to create a new list with 3 rows
- that list equate to the dataframe

In [15]:
job=['DS','DE','CS']
df['JOB']=job
df

     Names  Age     City JOB
0    Ayush   25      hyd  DS
1  Avinash   30      brl  DE
2    Akash   35  chennai  CS

In [37]:
import pandas as pd
names=['Ayush', 'Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','brl','chennai','Mumbai']
idx=['A', 'B', 'C','D']
data=zip(names,age,city)
cols=['Names' , 'Age', 'City']
pd.DataFrame(data, columns=cols)

     Names  Age     City
0    Ayush   25      hyd
1  Avinash   30      brl
2    Akash   35  chennai
3     Anvi   40   Mumbai

$Step-5$

**Update the already Existed column**

- Createve new column and update new column both are same way

In [41]:
df['Age']=[35,40,45]
df

     Names  Age     City JOB
0    Ayush   35      hyd  DS
1  Avinash   40      brl  DE
2    Akash   45  chennai  CS

$Step-6$

**Change the index**

In [55]:
import pandas as pd
names=['Ayush', 'Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','brl','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names' , 'Age', 'City']
idx=['A', 'B', 'C','D']
df=pd.DataFrame(data,
                columns=cols,
                index=idx)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

**Note**

- Number of list equals to **Number of columns**
- Number of value inside list equal to **Number of rows**
- When you create the data all the lists will be in same length

$Step-7$

**shape**

- Number of rows
- Number of columns

In [58]:
df.shape
# Matrix format
# 4 rows and 3 columns
print("the number of rows are:", df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 4
the number of columns are: 3

$Step-8$

**Drop the column**
- In order to drop column we required 3 arguments
- column name
    - The column name we need to mention
- axis
    - axis=0 **represents rows**
    - axis=1 **represents column**
- inplace
    - we are drop column means we are modifying the data frame
    - so this modifications we want to save in same variable or different variable
    - If you want to keep in the same variable the **inplace=True**

In [67]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [68]:
df.drop('City',axis=1)

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [69]:
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [70]:
df.drop('City',axis=1,inplace=True)

In [71]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [72]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [73]:
df1=df.drop('Age',axis=1) #do not give inplace=True

In [74]:
df # has two columns

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [75]:
df1

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [43]:
import pandas as pd
names=['Ayush', 'Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','brl','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names' , 'Age', 'City']
idx=['A', 'B', 'C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

#IMP

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [44]:
df.drop('City',axis=1,inplace=True)

In [45]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [48]:
df.drop('Age',axis=1)

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [47]:
df

     Names  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

$Step-9$

**Multiple columns drop**

In [57]:
#again read the data
import pandas as pd
names=['Ayush', 'Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','brl','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names' , 'Age', 'City']
idx=['A', 'B', 'C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [58]:
df.drop(['Age','City'],axis=1,inplace=True)

In [59]:
df

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

$Step-10$

**Drop the rows**

In [67]:
#again read the data
import pandas as pd
names=['Ayush', 'Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['hyd','brl','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names' , 'Age', 'City']
idx=['A', 'B', 'C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

     Names  Age     City
A    Ayush   25      hyd
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [53]:
df.drop('A',axis=0,inplace=True)

In [54]:
df

     Names  Age     City
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [68]:
df.drop(['A','B'],axis=0,inplace=True)
df

   Names  Age     City
C  Akash   35  chennai
D   Anvi   40   Mumbai

$Step-11$

**How to save the data frame**

- Generally data frames are two types
- CSV (comma seperated value)extention=.csv
- excel(extension=.xlsx)

In [62]:
df

     Names  Age     City
B  Avinash   30      brl
C    Akash   35  chennai
D     Anvi   40   Mumbai

In [69]:
#file name=data
#extention=.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [70]:
# Extension
#.xLsx
df.to_excel("data2.xlsx",index=False)